config.org
#+TITLE: Config
* General Settings
**  Setting my font for Doom Emacs, and making it pretty
#+begin_src emacs-lisp
  (setq doom-font (font-spec :family "VictorMono Nerd Font Mono" :size 32))
  (setq doom-theme 'doom-solarized-light)
  (setq display-line-numbers-type 'relative)
  (setq edebug-print-length 'nil)
#+end_src

**  Makes Richard Stallman visit my Emacs
#+begin_src emacs-lisp
(setq fancy-splash-image "~/Pictures/emacs.png")
#+end_src

**  Other small improvements
#+begin_src emacs-lisp
(setq auto-save-default t)
(setq which-key-idle-delay 0.25)
(display-time-mode 1)
#+end_src

**  Spelling in Emacs
#+begin_src emacs-lisp
;;(setq ispell-dictionary "en-custom")
;;(setq ispell-personal-dictionary (expand-file-name ".ispell_personal" doom-private-dir))
#+end_src

**  General LSP stuff
#+begin_src emacs-lisp
(after! lsp-ui
  (setq lsp-ui-doc-enable 1)
  (setq! lsp-ui-doc-delay 0)
  (setq lsp-ui-doc-show-with-cursor t)
  (setq lsp-ui-doc-max-width 200)
  (setq lsp-ui-doc-max-height 50)
  (setq lsp-ui-doc-use-webkit nil)
  (setq lsp-ui-doc-border 'unspecified)
  (setq! lsp-ui-peek-enable t))
(after! lsp
  (setq lsp-enable-symbol-highlighting nil))

#+end_src

**  Adding info-colors to improving reaidngs:
Tell doom the package exists
#+begin_src emacs-lisp :tangle packages.el
(package! info-colors :pin "47ee73cc19b1049eef32c9f3e264ea7ef2aaf8a5")
#+end_src

Actually using the package
#+begin_src emacs-lisp
(use-package! info-colors
  :hook (Info-selection . info-colors-fontify-node))
#+end_src
**  Making Infos no longer a popup
#+begin_src emacs-lisp
(set-popup-rules! '(("^\\*info\\*$" ; Info buffers
                     :ignore t)))
#+end_src
**  Keycast for showing off Emacs
Installing Keycast
#+begin_src emacs-lisp :tangle packages.el
(package! keycast :pin "04ba7519f34421c235bac458f0192c130f732f12")
#+end_src
Making Keycast work in the modeline:
#+begin_src emacs-lisp
(use-package! keycast
  :commands keycast-mode
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key binding in the mode line."
    :global t
    (if keycast-mode
        (progn
          (add-hook 'pre-command-hook 'keycast--update t)
          (add-to-list 'global-mode-string '("" mode-line-keycast " ")))
      (remove-hook 'pre-command-hook 'keycast--update)
      (setq global-mode-string (remove '("" mode-line-keycast " ") global-mode-string))))
  (custom-set-faces!
    '(keycast-command :inherit doom-modeline-debug
                      :height 0.9)
    '(keycast-key :inherit custom-modified
                  :height 1.1
                  :weight)))
#+end_src

**  Modeline tweak to not show utf-8
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8, so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (unless (and (memq (plist-get (coding-system-plist buffer-file-coding-system) :category)
                                 '(coding-category-undecided coding-category-utf-8))
                           (not (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t)))

(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)

#+end_src

* Org-mode stuffs
Setting org directory
#+begin_src emacs-lisp
(setq org-directory "~/Org/")
#+end_src

Making small changes to org that make org more usable for notes and literate development
#+begin_src emacs-lisp
(after! org
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
  (setq org-src-fontify-natively t)
 ;; (add-hook 'org-mode-hook 'turn-on-flyspell)
  (setq org-startup-folded t))
#+end_src

Making org-super-agenda usable once i install this on wsl(eventually)
#+begin_src emacs-lisp
;;(use-package! org-super-agenda
 ;; :after org-agenda
 ;; :init
  ;;setq org-super-agenda-groups '((:name "Today"
 ;;                                         :time-grid t
   ;;                                       :scheduled today)
    ;;                              (:name "Due today"
     ;;                                     :deadline today)
      ;;                            (:name "Important"
        ;;                                  :priority "A")
           ;;                       (:name "overdue"
         ;;                                 :deadline past)
       ;;                           (:name "Due soon"
     ;;                                    :deadline future)
   ;;                               (:name "Big Outcomes"
         ;;                                :tag "bo")))
 ;; :config
#+end_src

making org bullets look silly
#+begin_src emacs-lisp
(after! org-superstar
  (setq org-superstar-headline-bullets-list'("☕" "☀" "☎" "☞" "☭" "☯" "☮") org-superstar-prettify-item-bullets t))

#+end_src

* Rust stuff
setting up rust lsp stuffs
#+begin_src emacs-lisp
(after! rustic
  (setq rustic-lsp-server 'rust-analyzer))
#+end_src

